* Rahil Sayyad
* Email id: rahilsayyad389@gmail.com

In [53]:
import pandas as pd

In [85]:
Rs={"Name":["rahil","raj","sumit","mayur"],"age":[20,21,20,19]}

In [86]:
Rs

{'Name': ['rahil', 'raj', 'sumit', 'mayur'], 'age': [20, 21, 20, 19]}

In [87]:
sr=pd.DataFrame(Rs)
sr

    Name  age
0  rahil   20
1    raj   21
2  sumit   20
3  mayur   19

## group by name

In [88]:
sr.groupby('Name')

In [89]:
mn=sr.groupby('Name')

In [90]:
mn

In [91]:
mn.mean() # find mean

        age
Name
mayur  19.0
rahil  20.0
raj    21.0
sumit  20.0

In [92]:
mn.std() #Find std

       age
Name
mayur  NaN
rahil  NaN
raj    NaN
sumit  NaN

In [93]:
mn.min()# find min value

       age
Name
mayur   19
rahil   20
raj     21
sumit   20

In [84]:
mn.max()# find min value

       age    add
Name
mayur   24  nagar
rahil   20    Bmt
raj     21   pune
sumit   22    bmt

In [94]:
mn.count()# find count of all

       age
Name
mayur    1
rahil    1
raj      1
sumit    1

In [95]:
mn.describe() # describe data in detail

        age
      count  mean std   min   25%   50%   75%   max
Name
mayur   1.0  19.0 NaN  19.0  19.0  19.0  19.0  19.0
rahil   1.0  20.0 NaN  20.0  20.0  20.0  20.0  20.0
raj     1.0  21.0 NaN  21.0  21.0  21.0  21.0  21.0
sumit   1.0  20.0 NaN  20.0  20.0  20.0  20.0  20.0

In [96]:
mn.describe().T # describe data in detail

Name       mayur  rahil   raj  sumit
age count    1.0    1.0   1.0    1.0
    mean    19.0   20.0  21.0   20.0
    std      NaN    NaN   NaN    NaN
    min     19.0   20.0  21.0   20.0
    25%     19.0   20.0  21.0   20.0
    50%     19.0   20.0  21.0   20.0
    75%     19.0   20.0  21.0   20.0
    max     19.0   20.0  21.0   20.0

In [97]:
mn.describe().T['rahil']  # describe data in detail spacific column

age  count     1.0
     mean     20.0
     std       NaN
     min      20.0
     25%      20.0
     50%      20.0
     75%      20.0
     max      20.0
Name: rahil, dtype: float64

In [102]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB','facebook','facebook','amazon'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah','rahil','sumit','raj'],
       'Sales':[200,120,340,124,243,350,400,370,1000]}

In [104]:
mx=pd.DataFrame(data)

In [105]:
mx

    Company   Person  Sales
0      GOOG      Sam    200
1      GOOG  Charlie    120
2      MSFT      Amy    340
3      MSFT  Vanessa    124
4        FB     Carl    243
5        FB    Sarah    350
6  facebook    rahil    400
7  facebook    sumit    370
8    amazon      raj   1000

In [107]:
mx.groupby('Company') #group by company

In [108]:
ml=mx.groupby('Company')

In [109]:
ml.mean() # find mean

           Sales
Company
FB         296.5
GOOG       160.0
MSFT       232.0
amazon    1000.0
facebook   385.0

In [110]:
ml.max() #find max

           Person  Sales
Company
FB          Sarah    350
GOOG          Sam    200
MSFT      Vanessa    340
amazon        raj   1000
facebook    sumit    400

In [111]:
ml.min()#find min

           Person  Sales
Company
FB           Carl    243
GOOG      Charlie    120
MSFT          Amy    124
amazon        raj   1000
facebook    rahil    370

In [112]:
ml.count()#find count

          Person  Sales
Company
FB             2      2
GOOG           2      2
MSFT           2      2
amazon         1      1
facebook       2      2

In [113]:
ml.describe() # describe data in detail

         Sales
         count    mean         std     min      25%     50%      75%     max
Company
FB         2.0   296.5   75.660426   243.0   269.75   296.5   323.25   350.0
GOOG       2.0   160.0   56.568542   120.0   140.00   160.0   180.00   200.0
MSFT       2.0   232.0  152.735065   124.0   178.00   232.0   286.00   340.0
amazon     1.0  1000.0         NaN  1000.0  1000.00  1000.0  1000.00  1000.0
facebook   2.0   385.0   21.213203   370.0   377.50   385.0   392.50   400.0

In [115]:
ml.describe().T

Company              FB        GOOG        MSFT  amazon    facebook
Sales count    2.000000    2.000000    2.000000     1.0    2.000000
      mean   296.500000  160.000000  232.000000  1000.0  385.000000
      std     75.660426   56.568542  152.735065     NaN   21.213203
      min    243.000000  120.000000  124.000000  1000.0  370.000000
      25%    269.750000  140.000000  178.000000  1000.0  377.500000
      50%    296.500000  160.000000  232.000000  1000.0  385.000000
      75%    323.250000  180.000000  286.000000  1000.0  392.500000
      max    350.000000  200.000000  340.000000  1000.0  400.000000

In [116]:
ml.describe().T['facebook']

Sales  count      2.000000
       mean     385.000000
       std       21.213203
       min      370.000000
       25%      377.500000
       50%      385.000000
       75%      392.500000
       max      400.000000
Name: facebook, dtype: float64